/**
********************************************************************************
* Copyright (c) 2006 CAS
* @brief   Cts Mode Applicaion Source File\n
* @file    CtsModeApp.c
* @version 1.0
* @date    2013/01/25
* @author  Deok Hyun Kim (KDH)
********************************************************************************
* @remark  [Version History]\n
*          v1.0 2006/10/02 created by HYP \n
********************************************************************************
*/

/*
********************************************************************************
*                       INCLUDES
********************************************************************************
*/
/* Insert include files here */
#include "../Common/Globals.h"
#include "../Common/CommonLib.h"
#include "../Time/TimeApi.h"
#include "CtsModeApp.h"

#ifdef USE_CTS_MODE
/*
********************************************************************************
*                       GLOBAL(EXPORTED) VARIABLES & TABLES
********************************************************************************
*/
/* Insert global variables & tables here */

/*
********************************************************************************
*                       LOCAL DEFINITIONS & MACROS
********************************************************************************
*/
/* Insert #define here */

/** @brief CTS CMD : CAL enter enable */
#define CAL_K           0xCA082012
/** @brief CTS CMD : Set CTS mode enable */
#define CTSON_K         0xCB419324
/** @brief CTS CMD : Set CAL mode disable */
#define CTSOFF_K        0xCC398743
/** @brief CTS CMD : Set CAL complete */
#define CALCOMP_K       0xCD137423
/** @brief CTS CMD : Set CTS period */
#define PERIOD_K        0x34190000
/** @brief Encryption key : Time */
#define K_TIME          0x00083419
/** @brief Encryption key : Zero */
#define K_ZERO          0x41908300
/** @brief Encryption key : Span */
#define K_SPAN          0x19830419

/** @brief Flag : CTS initialized */
#define CTS_INIT_COMPLETED 0x83


/*
********************************************************************************
*                       LOCAL DATA TYPES & STRUCTURES
********************************************************************************
*/
/* Insert local typedef & structure here */

/** @brief Time data*/
typedef struct {
	/** @brief Second*/
	INT8U sec;
	/** @brief Minute*/
	INT8U min;
	/** @brief Hour*/
	INT8U hour;
	/** @brief Date*/
	INT8U date;
	/** @brief Month*/
	INT8U month;
	/** @brief Day, 0~6*/
	INT8U day;
	/** @brief year*/
	INT8U year;	
} TIME_DATA;

/** @brief eeprom에 저장되는 CTS 데이터*/
typedef struct {
	INT8U  ctsEnable;			// 0
	INT8U  ctsVersion;			// 1
	INT8U  initialized;			// 2
	INT8U  ctsExpired;			// 3
	INT8U  ctsCalYear;			// 4
	INT8U  ctsCalMonth;			// 5
	INT8U  ctsCalDate;			// 6
	INT8U  reserve1;			// 7
	INT16U ctsPeriod;			// 8
	INT16U reserve2;			// 10
	INT8U  serialNo[16];		// 12
	INT8U  productCode[16];		// 28
	INT32U boardId;				// 44
	INT32U encryptKey1;			// 48
	INT8U  reserve[26];			// 52
	INT8U  bccErrFlag;			// 78	// bccError가 발생할 경우 CTS_ERROR 1로 기록
	INT8U  bcc;					// 79
} CTS_STRUCT;					//size 80, rom 데이터

/** @brief 암호화에 사용되는 저울정보 백업*/
typedef struct {
	INT32S zero;
	INT32S midUp;
	INT32S midDn;
	INT32S span;
	INT32U time;
} CTS_ENCRYPT_BUF_STRUCT;  	// size 12, ram 데이터, 암호화에 사용되는 데이터

/** @brief 저울 정보*/
typedef struct {
	INT8U  modelName[12];		//0
	INT32U scaleVersion;		//12
	INT32S zero;				//16
	INT32S midUp;				//20
	INT32S midDn;				//24
	INT32S span;				//28
	INT16U gravityFactory;		//32
	INT16U gravityLocal;		//34
	INT32U capa;				//36
	INT8U  e;					//40
	INT8U  d;					//41
	INT8U  wdp;					//42
	INT8U  calState;			//43
	INT8U  unit[2];				//44
} CTS_INFO_STRUCT;				// size 46, ram 데이터, 저울 정보

/** @brief 외부로 전달될 CMD*/
typedef struct {
	INT8U  calEnable;
	INT8U  calComp;
} CTS_CMD_STRUCT;


/*
********************************************************************************
*                       GLOBAL(FILE SCOPE) VARIABLES & TABLES
********************************************************************************
*/
/* Insert file scope variable & tables here */
/** @brief 저울 정보*/
CTS_INFO_STRUCT data CtsInfoStruct; // OMV2 환경 xdata 부족하여 data 영역 사용. OMV4에서는 영향 없음 확인.
/** @brief 외부에 저장된 CTS 데이터의 포인터*/
CTS_STRUCT *CtsStructPtr;
/** @brief 암호화에 사용되는 저울정보 백업*/
CTS_ENCRYPT_BUF_STRUCT CtsEncryptBufStruct; 
/** @brief 외부로 전달될 CMD*/
CTS_CMD_STRUCT CtsCmdStruct;
/** @brief 시간 정보 백업*/
TIME_DATA TimeDataBuf;

/*
********************************************************************************
*                       LOCAL FUNCTION PROTOTYPES
