/**
********************************************************************************
* Copyright (c) 2012 CAS
* @brief   Time Driver Source File\n
           Chip : None
* @file    TimeDrv_None.c
* @version 1.0
* @date    2012/09/24
* @author  Young Hoon Lee (LYH)
********************************************************************************
* @remark  [Version History]\n
*          v1.0 2012/09/24 created by LYH \n
********************************************************************************
*/

/*
********************************************************************************
*                       INCLUDES
********************************************************************************
*/
/* Insert include files here */
#include "../Common/Globals.h"
#include "../Common/CommonLib.h"
#include "../Common/TimeData.h"
#include "TimeDrv.h"
#include "../Hardware/HardwareConfig.h"

#ifdef TIME_DRV_NONE
/*
********************************************************************************
*                       GLOBAL(EXPORTED) VARIABLES & TABLES
********************************************************************************
*/
/* Insert global variables & tables here */


/*
********************************************************************************
*                       LOCAL DEFINITIONS & MACROS
********************************************************************************
*/
/* Insert #define here */

/*
********************************************************************************
*                       LOCAL DATA TYPES & STRUCTURES
********************************************************************************
*/
/* Insert local typedef & structure here */


/*
********************************************************************************
*                       GLOBAL(FILE SCOPE) VARIABLES & TABLES
********************************************************************************
*/
/* Insert file scope variable & tables here */


/*
********************************************************************************
*                       LOCAL FUNCTION PROTOTYPES
********************************************************************************
*/
/* Insert static function prototypes here */

/*
********************************************************************************
*                       GLOBAL(EXPORTED) FUNCTIONS
********************************************************************************
*/
/* Insert global functions here */
/**
********************************************************************************
* @brief    Time Drvier Init 함수\n
* @param    none
* @return   none
* @remark   초기에 한번 실행 되는 함수\n
********************************************************************************
*/
void TimeDrvInit(void)
{
}

/**
********************************************************************************
* @brief    Time Driver Write Time Struct 함수\n
* @param    none
* @return   none
* @remark   TimeData 구조체 내용을 Time IC에 쓴다.\n
********************************************************************************
*/
void TimeDrvWriteAllClkData(void)
{
}

/**
********************************************************************************
* @brief    Time Driver Read Time Struct 함수\n
* @param    none
* @return   none
* @remark   Time IC에서 Time값을 일어 TimeData 구조체에 쓴다.\n
********************************************************************************
*/
void TimeDrvReadAllClkData(void)
{
}

/*
********************************************************************************
*                       LOCAL FUNCTIONS
********************************************************************************
*/
/* Insert local functions here */

#endif//#ifdef TIME_DRV_NONE
